Config/Documents/ФормированиеПроводокПоТранспортномуНалогу.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ФормированиеПроводокПоТранспортномуНалогу</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НачисленияПоТранспортномуНалогу</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидыПлатежейВГосБюджет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПлатежейВГосБюджет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособФормирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособФормирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаСнятияСРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНалога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаГодовая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Авансы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговаяБаза</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>17</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговаяСтавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/РегистрацияТранспортныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РегистрацияТранспортныхСредств</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВключатьВНалоговуюБазу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйЗнак</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПостановкаНаУчетВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПостановкаНаУчетВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидТранспортногоСредства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяБаза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмеренияНалоговойБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОснованиеЛьготы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияЛьготПоИмущественнымНалогам</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЛьготнаяСтавка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУменьшения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>17</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачалоДействияЛьготы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеДействияЛьготы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭкологическийКласс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьЭкологическийКласс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяСобственность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляВПравеОбщейСобственностиЧислитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляВПравеОбщейСобственностиЗнаменатель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышающийКоэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗарегистрированоВРеестреСистемыПлатон</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПоОКАТОДо2014</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодВидаТранспортногоСредстваДо2020</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НалоговаяЛьготаДо2020</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговыхЛьготПоТранспортномуНалогуДо2020</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодНалоговойЛьготыДо2020</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегиональныйКодЛьготыДо2020</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентУменьшенияДо2020</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьНалоговаяСтавкаЗависитОтГодаВыпускаТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидЗаписи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидЗаписиОРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОсновноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/СпособФормирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособФормирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаКвартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаГод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидЗаписиОРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидЗаписиОРегистрации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Регистрация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СнятиеСРегистрационногоУчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ФормированиеПроводокПоТранспортномуНалогу/Forms/ФормаДокументаУпр/Ext/Form/Module.bsl
Процедура ОсновныеДействияФормыНастройка(Кнопка)
	//ОбщегоНазначения.РучнаяКорректировкаОсновнаяФорма(ЭтоНовый(),Ссылка,ЭтотОбъект);
КонецПроцедуры 

Процедура ДатаПриИзменении(Элемент)
	Дата = КонецКвартала(Дата);  	
	Если Объект.СпособФормирования = Перечисления.СпособФормирования.ЗаКвартал Тогда
		НачалоПериода = НачалоКвартала(Дата);
		КонецПериода = КонецКвартала (Дата);
	ИначеЕсли Объект.СпособФормирования = Перечисления.СпособФормирования.ЗаГод Тогда
		НачалоПериода = НачалоГода(Дата);
		КонецПериода = КонецГода (Дата); 		
	КонецЕсли;	    
КонецПроцедуры

Процедура СпособФормированияПриИзменении(Элемент) 
	
	СпособФормирования = Объект.СпособФормирования;
	Дата = Объект.Дата;
	
	Объект.ТабЧасть.Очистить(); 
	Если СпособФормирования = Перечисления.СпособФормирования.ЗаКвартал Тогда
		НачалоПериода = НачалоКвартала(Дата);
		КонецПериода = КонецКвартала (Дата);
		//ЭлементыФормы.ТабЧасть.Колонки.Авансы.Видимость=Ложь;
		//ЭлементыФормы.ТабЧасть.Колонки.СуммаГодовая.Видимость=Ложь; 
	ИначеЕсли СпособФормирования = Перечисления.СпособФормирования.ЗаГод Тогда
		НачалоПериода = НачалоГода(Дата);
		КонецПериода = КонецГода (Дата); 
		//ЭлементыФормы.ТабЧасть.Колонки.Авансы.Видимость=Истина;
		//ЭлементыФормы.ТабЧасть.Колонки.СуммаГодовая.Видимость=Истина; 
	КонецЕсли;  	
КонецПроцедуры

Функция РасчетКоэффициента(ДатаРег, ДатаСнятияСРег, КолМес)
	Если ДатаРег<=Объект.НачалоПериода И (ДатаСнятияСРег>=Объект.КонецПериода ИЛИ ДатаСнятияСРег = '00010101') Тогда
		Коэф = 1;
	ИначеЕсли
		ДатаРег>Объект.НачалоПериода И (ДатаСнятияСРег>=Объект.КонецПериода ИЛИ ДатаСнятияСРег = '00010101')Тогда
		Коэф = Окр((Месяц(Объект.КонецПериода)-Месяц(ДатаРег)+1)/КолМес,4); 
	ИначеЕсли
		ДатаРег<=Объект.НачалоПериода И ДатаСнятияСРег<Объект.КонецПериода Тогда
		Коэф = Окр((Месяц(ДатаСнятияСРег)/КолМес),4);
	ИначеЕсли
		ДатаРег>Объект.НачалоПериода И ДатаСнятияСРег<Объект.КонецПериода Тогда
		Коэф = Окр((Месяц(ДатаСнятияСРег)-Месяц(ДатаРег)+1)/КолМес,4);
	КонецЕсли;	 
	Возврат Коэф;	
КонецФункции

Функция ПолучитьДатуСнятияСРегистрации(ОС)
	
	Запрос = Новый Запрос; 	
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("ВидЗаписи",Перечисления.ВидЗаписиОРегистрации.СнятиеСРегистрационногоУчета);
	Запрос.УстановитьПараметр("НачалоПериода",Объект.НачалоПериода); 	
	Запрос.УстановитьПараметр("КонецПериода",Объект.КонецПериода); 
	Запрос.УстановитьПараметр("ОсновноеСредство",ОС); 	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрацияТранспортныхСредств.Период
	|ИЗ
	|	РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
	|ГДЕ
	|	РегистрацияТранспортныхСредств.Организация = &Организация
	|	И РегистрацияТранспортныхСредств.ВидЗаписи = &ВидЗаписи
	|	И РегистрацияТранспортныхСредств.ОсновноеСредство = &ОсновноеСредство";		
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДатаСнятияСРегистрации = Выборка.Период;
	Иначе ДатаСнятияСРегистрации = '00010101'; 	
	КонецЕсли;
	
	Возврат ДатаСнятияСРегистрации	
	
КонецФункции

Функция РасчетАванса(ОС)
	
	Запрос = Новый Запрос; 	
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("НачалоПериода",Объект.НачалоПериода); 	
	Запрос.УстановитьПараметр("КонецПериода",ДобавитьМесяц(КонецДня(Объект.КонецПериода),-3)); 
	Запрос.УстановитьПараметр("ОсновноеСредство",ОС); 	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(НачисленияПоТранспортномуНалогу.СуммаНалога) КАК СуммаНалога
	|ИЗ
	|	РегистрНакопления.НачисленияПоТранспортномуНалогу КАК НачисленияПоТранспортномуНалогу
	|ГДЕ
	|	НачисленияПоТранспортномуНалогу.Организация = &Организация
	|	И НачисленияПоТранспортномуНалогу.ТранспортноеСредство = &ОсновноеСредство
	|	И НачисленияПоТранспортномуНалогу.Период МЕЖДУ &НачалоПериода И &КонецПериода";	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СуммаАванса  = Выборка.СуммаНалога;
	Иначе СуммаАванса = 0; 	
	КонецЕсли;
	
	Возврат СуммаАванса	
	
КонецФункции	

Процедура ПередОткрытием(Отказ, СтандартнаяОбработка)
	//Если СпособФормирования<>Перечисления.СпособФормирования.ЗаГод Тогда
	//        ЭлементыФормы.ТабЧасть.Колонки.Авансы.Видимость = Ложь;
	//	    ЭлементыФормы.ТабЧасть.Колонки.СуммаГодовая.Видимость = Ложь;
	//КонецЕсли;  
КонецПроцедуры

Процедура ТабЧастьАвансыПриИзменении(Элемент)	
	//СтрТабЧасти = ЭлементыФормы.ТабЧасть.ТекущиеДанные;
	//СтрТабЧасти.СуммаНалога = СтрТабЧасти.Коэффициент*СтрТабЧасти.СуммаГодовая - СтрТабЧасти.Авансы;  
КонецПроцедуры

Процедура ТабЧастьКоэффициентПриИзменении(Элемент)	
	//СтрТабЧасти = ЭлементыФормы.ТабЧасть.ТекущиеДанные;
	//СтрТабЧасти.СуммаНалога = СтрТабЧасти.Коэффициент*СтрТабЧасти.СуммаГодовая-СтрТабЧасти.Авансы;  
КонецПроцедуры

&НаСервере
Функция ПолучитСтавкуНаСервере(НалоговаяБаза,КодВидаТранспортногоСредства)
	
	НалоговыйОрган = Объект.Организация.РегистрацияВНалоговомОргане;
	ОКТМО = "";
	
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НалоговыйОрган, "Код, КПП, КодПоОКТМО");
	
	ОКТМО = Реквизиты.КодПоОКТМО;
	ОКТМОПредставление = СокрЛП(Реквизиты.КодПоОКТМО);
	
	ДанныеДляЗаполнения = Новый Структура();
	ДанныеДляЗаполнения.Вставить("ОКТМО",ОКТМО);
	ДанныеДляЗаполнения.Вставить("КодВидаТранспортногоСредства",КодВидаТранспортногоСредства);
	ДанныеДляЗаполнения.Вставить("Период",КонецГода(Объект.Дата));
	ДанныеДляЗаполнения.Вставить("НалоговаяБаза",НалоговаяБаза);
	
	
	// Для кодов автономных округов в составе края (области), являющихся субъектами РФ,
	// значимыми для идентификации субъекта являются 1-й, 2-й и 3-й знаки.
	КодПоОКТМО = Лев(ДанныеДляЗаполнения.ОКТМО, 3);
	
	// Для остальных субъектов РФ значимые для идентификации знаки 1-й и 2-й.
	Если НЕ (КодПоОКТМО = "118" ИЛИ КодПоОКТМО = "718" ИЛИ КодПоОКТМО = "719") Тогда
		КодПоОКТМО = Лев(КодПоОКТМО, 2);
	КонецЕсли;
	
	Макет = РегистрыСведений.РегистрацияТранспортныхСредств.ПолучитьМакет("КодыВидовИКатегорииТС");
	КодыВидовИКатегорииТС = ОбщегоНазначения.ПрочитатьXMLВТаблицу(Макет.ПолучитьТекст()).Данные;
	
	НайденнаяСтрока = КодыВидовИКатегорииТС.Найти(ДанныеДляЗаполнения.КодВидаТранспортногоСредства, "КодВида");
	Если НайденнаяСтрока = Неопределено Тогда
		НалоговаяСтавкаНайдена = Ложь;
		Возврат(0);
	Иначе
		КатегорияТС = НайденнаяСтрока.Категория;
	КонецЕсли;
	
	Год = Год(ДанныеДляЗаполнения.Период);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Период", ?(Год > 2014, ДанныеДляЗаполнения.Период, Дата('20150101')));
	Запрос.УстановитьПараметр("ОКТМО", ?(СтрДлина(КодПоОКТМО) = 3, КодПоОКТМО + "00000", КодПоОКТМО + "000000"));
	Запрос.УстановитьПараметр("НаименованиеОбъектаНалогообложения", Перечисления.КатегорииТранспортныхСредств[КатегорияТС]);
	Запрос.УстановитьПараметр("НалоговаяБаза", ДанныеДляЗаполнения.НалоговаяБаза);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтавкиТранспортногоНалогаСрезПоследних.Период КАК Период,
	|	СтавкиТранспортногоНалогаСрезПоследних.ОКТМО КАК ОКТМО,
	|	СтавкиТранспортногоНалогаСрезПоследних.НаименованиеОбъектаНалогообложения КАК НаименованиеОбъектаНалогообложения,
	|	СтавкиТранспортногоНалогаСрезПоследних.МинимальноеЗначениеМощности КАК МинимальноеЗначениеМощности,
	|	СтавкиТранспортногоНалогаСрезПоследних.МаксимальноеЗначениеМощности КАК МаксимальноеЗначениеМощности,
	|	СтавкиТранспортногоНалогаСрезПоследних.МинимальноеКоличествоЛетСГодаВыпускаТС КАК МинимальноеКоличествоЛетСГодаВыпускаТС,
	|	СтавкиТранспортногоНалогаСрезПоследних.МаксимальноеКоличествоЛетСГодаВыпускаТС КАК МаксимальноеКоличествоЛетСГодаВыпускаТС,
	|	СтавкиТранспортногоНалогаСрезПоследних.НалоговаяСтавка КАК НалоговаяСтавка
	|ПОМЕСТИТЬ ВТВсеПодходящиеЗаписи
	|ИЗ
	|	РегистрСведений.СтавкиТранспортногоНалога.СрезПоследних(
	|			&Период,
	|			ОКТМО = &ОКТМО
	|				И НаименованиеОбъектаНалогообложения = &НаименованиеОбъектаНалогообложения
	|				И МинимальноеЗначениеМощности <= &НалоговаяБаза
	|				И (МаксимальноеЗначениеМощности = 0
	|					ИЛИ &НалоговаяБаза <= МаксимальноеЗначениеМощности)) КАК СтавкиТранспортногоНалогаСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТВсеПодходящиеЗаписи.Период) КАК Период
	|ПОМЕСТИТЬ ВТПериодПоследнейЗаписи
	|ИЗ
	|	ВТВсеПодходящиеЗаписи КАК ВТВсеПодходящиеЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТВсеПодходящиеЗаписи.Период КАК Период,
	|	ВТВсеПодходящиеЗаписи.ОКТМО КАК ОКТМО,
	|	ВТВсеПодходящиеЗаписи.НаименованиеОбъектаНалогообложения КАК НаименованиеОбъектаНалогообложения,
	|	ВТВсеПодходящиеЗаписи.МинимальноеЗначениеМощности КАК МинимальноеЗначениеМощности,
	|	ВТВсеПодходящиеЗаписи.МаксимальноеЗначениеМощности КАК МаксимальноеЗначениеМощности,
	|	ВТВсеПодходящиеЗаписи.МинимальноеКоличествоЛетСГодаВыпускаТС КАК МинимальноеКоличествоЛетСГодаВыпускаТС,
	|	ВТВсеПодходящиеЗаписи.МаксимальноеКоличествоЛетСГодаВыпускаТС КАК МаксимальноеКоличествоЛетСГодаВыпускаТС,
	|	ВЫБОР
	|		КОГДА ВТВсеПодходящиеЗаписи.МинимальноеКоличествоЛетСГодаВыпускаТС > 0
	|				ИЛИ ВТВсеПодходящиеЗаписи.МаксимальноеКоличествоЛетСГодаВыпускаТС > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК НалоговаяСтавкаЗависитОтГодаВыпускаТС,
	|	ВТВсеПодходящиеЗаписи.НалоговаяСтавка КАК НалоговаяСтавка
	|ИЗ
	|	ВТВсеПодходящиеЗаписи КАК ВТВсеПодходящиеЗаписи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТПериодПоследнейЗаписи КАК ВТПериодПоследнейЗаписи
	|		ПО ВТВсеПодходящиеЗаписи.Период = ВТПериодПоследнейЗаписи.Период";
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		НалоговаяСтавкаНайдена = Ложь;
		НалоговаяСтавка = 0;
		
	Иначе	
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НалоговаяСтавкаЗависитОтГодаВыпускаТС = Выборка.НалоговаяСтавкаЗависитОтГодаВыпускаТС;
			
			Если НалоговаяСтавкаЗависитОтГодаВыпускаТС Тогда
				ДатаВыпуска = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДляЗаполнения.ОсновноеСредство, "ДатаВыпуска");
				
				Если ЗначениеЗаполнено(ДатаВыпуска) Тогда
					
					КоличествоЛетСГодаВыпускаТС = Год - Год(ДатаВыпуска);
					Если Выборка.МинимальноеКоличествоЛетСГодаВыпускаТС <= КоличествоЛетСГодаВыпускаТС
						И (НЕ ЗначениеЗаполнено(Выборка.МаксимальноеКоличествоЛетСГодаВыпускаТС)
						ИЛИ КоличествоЛетСГодаВыпускаТС <= Выборка.МаксимальноеКоличествоЛетСГодаВыпускаТС) Тогда
						
						Возврат(Выборка.НалоговаяСтавка);
						
					КонецЕсли;
					
				Иначе
					
					Ошибка = Новый Структура("ТекстСообщения, Поле",
					НСтр("ru = 'Ставка налога установлена с учетом количества лет, прошедших с года выпуска транспортного средства.
					|Укажите дату выпуска основного средства.'"),
					"Запись.ОсновноеСредство");
					
					//Ошибки.Добавить(Ошибка);
					//
					//НалоговаяСтавкаНайдена = Ложь;
					//НалоговаяСтавка = 0;
					Возврат(0);
					
				КонецЕсли;
			Иначе
				
				Возврат(Выборка.НалоговаяСтавка);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура КоманднаяПанельЗаполнитьНаСервере()
	
	Если Объект.Организация = Справочники.Организации.ПустаяСсылка() Тогда
		Сообщить ("Не выбрана организация");
		Возврат;
	КонецЕсли; 	 
	Если Объект.ВидыПлатежейВГосБюджет = Перечисления.ВидыПлатежейВГосБюджет.ПустаяСсылка() Тогда
		Сообщить ("Не выбран вид платежей в бюджет (фонды)");
		Возврат;
	КонецЕсли;
	Если Объект.СпособФормирования = Перечисления.СпособФормирования.ПустаяСсылка() Тогда
		Сообщить ("Не выбран способ формирования проводок");
		Возврат;
	КонецЕсли;
	
	Если Объект.ТабЧасть.Количество() > 0 Тогда 		
		//ТекстВопроса = "Перед заполнением табличная часть будет очищена. Заполнить?";
		//Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, Метаданные().Синоним);
		//Если Ответ <> КодВозвратаДиалога.Да Тогда
		//	Возврат;
		//КонецЕсли; 		
		Объект.ТабЧасть.Очистить();
	КонецЕсли;	
	
	Запрос = Новый Запрос; 	
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("ВидЗаписи",Перечисления.ВидЗаписиОРегистрации.Регистрация);
	Запрос.УстановитьПараметр("НачалоПериода",НачалоДня(Объект.НачалоПериода)); 	
	Запрос.УстановитьПараметр("КонецПериода",КонецДня(Объект.КонецПериода)); 		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрацияТранспортныхСредств.ОсновноеСредство КАК ОсновноеСредство,
	|	РегистрацияТранспортныхСредств.Период КАК Период,
	|	РегистрацияТранспортныхСредств.НалоговаяБаза КАК НалоговаяБаза,
	|	РегистрацияТранспортныхСредств.НалоговаяСтавка КАК НалоговаяСтавка,
	|	РегистрацияТранспортныхСредств.СчетЗатрат КАК СчетЗатрат,
	|	РегистрацияТранспортныхСредств.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
	|	РегистрацияТранспортныхСредств.СтатьяЗатрат КАК СтатьяЗатрат,
	|	РегистрацияТранспортныхСредств.КодВидаТранспортногоСредства КАК КодВидаТранспортногоСредства
	|ИЗ
	|	РегистрСведений.РегистрацияТранспортныхСредств КАК РегистрацияТранспортныхСредств
	|ГДЕ
	|	РегистрацияТранспортныхСредств.Организация = &Организация
	|	И РегистрацияТранспортныхСредств.Период <= &КонецПериода
	|	И РегистрацияТранспортныхСредств.ВидЗаписи = &ВидЗаписи";		
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();	
	
	Если Объект.СпособФормирования = Перечисления.СпособФормирования.ЗаКвартал Тогда 
		
		Пока Выборка.Следующий() Цикл	
			ТранспортноеСредство = Выборка.ОсновноеСредство;
			ДатаСнятияСРегистрации = ПолучитьДатуСнятияСРегистрации(ТранспортноеСредство); 
			
			Если (ДатаСнятияСрегистрации>=Объект.НачалоПериода) ИЛИ (ДатаСнятияСрегистрации = '00010101') Тогда			
				СтрТабЧасти = Объект.ТабЧасть.Добавить();
				СтрТабЧасти.ТранспортноеСредство = ТранспортноеСредство;
				ДатаРегистрации = Выборка.Период;  
				СтрТабЧасти.ДатаРегистрации = ДатаРегистрации;
				СтрТабЧасти.ДатаСнятияСРегистрации = ПолучитьДатуСнятияСРегистрации(Выборка.ОсновноеСредство);
				СтрТабЧасти.СчетЗатрат = Выборка.СчетЗатрат;
				СтрТабЧасти.ПодразделениеЗатрат = Выборка.ПодразделениеЗатрат;  		
				СтрТабЧасти.СтатьяЗатрат = Выборка.СтатьяЗатрат;  
				СтрТабЧасти.НалоговаяБаза = Выборка.НалоговаяБаза;
				НалоговаяСтавка = ПолучитСтавкуНаСервере(Выборка.НалоговаяБаза,Выборка.КодВидаТранспортногоСредства);
				СтрТабЧасти.НалоговаяСтавка = НалоговаяСтавка;
			КонецЕсли; 
			
		КонецЦикла; 		
		
	ИначеЕсли Объект.СпособФормирования = Перечисления.СпособФормирования.ЗаГод Тогда
		
		Пока Выборка.Следующий() Цикл
			
			ТранспортноеСредство = Выборка.ОсновноеСредство;
			ДатаСнятияСРегистрации = ПолучитьДатуСнятияСРегистрации(ТранспортноеСредство);
			
			Если (ДатаСнятияСрегистрации>=Объект.НачалоПериода) ИЛИ (ДатаСнятияСрегистрации = '00010101') Тогда			
				СтрТабЧасти = Объект.ТабЧасть.Добавить();
				СтрТабЧасти.ТранспортноеСредство = ТранспортноеСредство;
				ДатаРегистрации = Выборка.Период;  
				СтрТабЧасти.ДатаРегистрации = ДатаРегистрации;
				СтрТабЧасти.ДатаСнятияСРегистрации = ПолучитьДатуСнятияСРегистрации(Выборка.ОсновноеСредство);
				СтрТабЧасти.СчетЗатрат = Выборка.СчетЗатрат;
				СтрТабЧасти.ПодразделениеЗатрат = Выборка.ПодразделениеЗатрат;  		
				СтрТабЧасти.СтатьяЗатрат = Выборка.СтатьяЗатрат;  
				СтрТабЧасти.НалоговаяБаза = Выборка.НалоговаяБаза;
				НалоговаяСтавка = ПолучитСтавкуНаСервере(Выборка.НалоговаяБаза,Выборка.КодВидаТранспортногоСредства);
				СтрТабЧасти.НалоговаяСтавка = НалоговаяСтавка;    
			КонецЕсли;
			
		КонецЦикла;		
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельЗаполнить(Команда)
	КоманднаяПанельЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КоманднаяПанельРассчитатьНаСервере()
	СпособФормирования = Объект.СпособФормирования;
	
	Для Каждого СтрТабЧасти Из Объект.ТабЧасть Цикл 	
		
		Если СпособФормирования = Перечисления.СпособФормирования.ЗаКвартал Тогда
			СтрТабЧасти.Коэффициент = РасчетКоэффициента(СтрТабЧасти.ДатаРегистрации,СтрТабЧасти.ДатаСнятияСРегистрации,3);
			СтрТабЧасти.СуммаНалога = СтрТабЧасти.Коэффициент * (СтрТабЧасти.НалоговаяБаза * СтрТабЧасти.НалоговаяСтавка)/4;
		ИначеЕсли СпособФормирования = Перечисления.СпособФормирования.ЗаГод Тогда
			СтрТабЧасти.Коэффициент = РасчетКоэффициента(СтрТабЧасти.ДатаРегистрации,СтрТабЧасти.ДатаСнятияСРегистрации,12);
			СтрТабЧасти.СуммаГодовая = СтрТабЧасти.Коэффициент * (СтрТабЧасти.НалоговаяБаза * СтрТабЧасти.НалоговаяСтавка);
			СтрТабЧасти.Авансы = РасчетАванса(СтрТабЧасти.ТранспортноеСредство);
			СтрТабЧасти.СуммаНалога = СтрТабЧасти.СуммаГодовая - СтрТабЧасти.Авансы; 
		КонецЕсли;
		
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельРассчитать(Команда)
	КоманднаяПанельРассчитатьНаСервере();
КонецПроцедуры
